<!-- add-pr-comment:./test/terraform -->

## Terraform Plan for Directory: `./test/terraform`
#### 🖌 **Terraform Format and Style:** `success`
#### ⚙️ **Terraform Initialization:** `success`
#### 🤖 **Terraform Validation:**  `success`
#### 📖 **Terraform Plan:** `success`

<details>
  <summary><b>🔍 Show Terraform Plan</b></summary>

  <blockquote>

```tf

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.test will be created
  + resource "local_file" "test" {
      + content              = "foo!"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./test.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

  </blockquote>
</details>